gojimmypi/IoT_BBQ/IoT_BBQ_STM32/_main.c
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void pwm_MX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = { 0 };

    /* GPIO Ports Clock Enable */
    __HAL_RCC_GPIOH_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /*Configure GPIO pin : PA8 */
    GPIO_InitStruct.Pin = GPIO_PIN_8;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}


// Callback: timer has rolled over
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    // Check which version of the timer triggered this callback and toggle LED
    if (htim == &htim2)
    {
        // HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
    }
}

void PWM_PulseFinishedCallback(TIM_HandleTypeDef* htim)
{
    // Check which version of the timer triggered this callback and toggle LED
    if (htim == &htim2)
    {
        // HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
    }
}

// not use; for reference only!
int pwm_main(void)
{    int32_t CH1_DC = 0;
 
    HAL_Init();
    pwm_SystemClock_Config();
    pwm_MX_GPIO_Init();
    pwm_MX_TIM2_Init();


    // HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_Base_Start_IT(&htim2);
    
    while (1)
    {
        while (CH1_DC < 65535)
        {
            TIM2->CCR1 = CH1_DC;
            CH1_DC += 70;
            // osDelay(555);
        }
        while (CH1_DC > 0)
        {
            TIM2->CCR1 = CH1_DC;
            CH1_DC -= 70;
            // osDelay(555);
        }
    }

}



/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
    //pwm_main();
    
    // run flash simulation demo
    Flash_Sim_Demo();


    /* STM32F4xx HAL library initialization:
         - Configure the Flash prefetch, instruction and Data caches
         - Configure the Systick to generate an interrupt each 1 msec
         - Set NVIC Group Priority to 4
         - Global MSP (MCU Support Package) initialization
    */
    HAL_Init();  

    GPIO_init();    
    
    LED2_ON();
    LED2_OFF();

    LED2_ON();
    LED2_OFF();

    LED2_ON();
    LED2_OFF();

    static uint8_t CrLf[] = "\n\r";

    if (BSP_PSENSOR_Init() == PSENSOR_OK)
    {
        //        float thisValue = BSP_PSENSOR_ReadPressure();
        //        static uint8_t Message[bufferLenth] = "Pressure = ";
        //        UART_TxMessageIntValue(Message, bufferLenth, (long)thisValue);
        //        UART_TxMessage(CrLf, bufferLenth);
        //        
    }
    else
    {
        while (1) ;
    }
    
   if (BSP_HSENSOR_Init() == HSENSOR_OK)
   {
//        float thisValue = BSP_HSENSOR_ReadHumidity();
//        static uint8_t Message[bufferLenth] = "Humidity = ";
//        UART_TxMessageIntValue(Message, bufferLenth, (long)thisValue);
//        UART_TxMessage(CrLf, bufferLenth);
   }
    else
    {
        while (1) ;
    }

    
   if (BSP_TSENSOR_Init() == TSENSOR_OK)
   {
//        float thisValue = BSP_TSENSOR_ReadTemp();
//        static uint8_t Message[bufferLenth] = "Temperature = ";
//        UART_TxMessageIntValue(Message, bufferLenth, (long)thisValue);
//        UART_TxMessage(CrLf, bufferLenth);
   }
    else
    {
        while (1) ;
    }

//    HAL_NVIC_DisableIRQ(DISCOVERY_I2Cx_ER_IRQn);
//    HAL_NVIC_DisableIRQ(DISCOVERY_I2Cx_EV_IRQn);
    

    if (1 == 1)
    {
        pwm_SystemClock_Config();
        pwm_MX_GPIO_Init();
        pwm_MX_TIM2_Init();
    
        //HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
        HAL_TIM_Base_Start_IT(&htim2);
        
    }

    
    // create a SwitchState variable to hold the result of out button press 
    GPIO_PinState SwitchState;

    // a couple of lines for debugging / testing
    SwitchState = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13);
    SwitchState = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13);

    SetAppState(Running);

    // See https://www.freertos.org/RTOS-Cortex-M3-M4.html
    // but where is our NVIC_PriorityGroupConfig?
    // NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
    
    /* Thread 1 definition */
    osThreadDef(LED1, LED_Thread1, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
  
    /*  Thread 2 definition */
    osThreadDef(LED2, LED_Thread2, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);    
    
    /* UART - Serial Port Debug */
    osThreadDef(UART1, UART_Thread1, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);

    osThreadDef(DISPLAY, DISPLAY_Thread1, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);

    osThreadDef(PWM, PWM_Thread1, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);

    
    
    /* Start thread 1 */
    LEDThread1Handle = osThreadCreate(osThread(LED1), NULL);
  
    /* Start thread 2 */
    LEDThread2Handle = osThreadCreate(osThread(LED2), NULL);
  
    /* UART is on a thread */
    // TODO loopback currently disabled; this thread does nothing!
    UART_Thread1Handle = osThreadCreate(osThread(UART1), NULL);
    
    /* the display in on a thread */
    DISPLAY_Thread1Handle = osThreadCreate(osThread(DISPLAY), NULL);

    /* our PWM */
    PWM_Thread1Handle = osThreadCreate(osThread(PWM), NULL);


    // Callbacks disabled
    // htim2.PWM_PulseFinishedCallback = PWM_PulseFinishedCallback;
    // htim2.PeriodElapsedCallback = HAL_TIM_PeriodElapsedCallback;

    // you can use interrupt priorities of 5 to 15 for your interrupts if they make FreeRTOS API calls
    HAL_NVIC_SetPriority(TIM2_IRQn, 15, 14);
    
    // ssd1306_TestFPS() in ssd1306_tests.c and this interrupt enabled causes a hard fault!
    HAL_NVIC_EnableIRQ(TIM2_IRQn);

    UART_init();

    /* Start scheduler */
    osKernelStart();


    /* We should never get here as control is now taken by the scheduler */
    for (;;) ;
}

void SysTick_Handler(void)
{
    HAL_IncTick();
    osSystickHandler();

    HAL_SYSTICK_IRQHandler(); // for UART
}

#define configADJUSTED_HEAP_SIZE	( configTOTAL_HEAP_SIZE - portBYTE_ALIGNMENT )

///* Allocate the memory for the heap. */
//#if( configAPPLICATION_ALLOCATED_HEAP == 1 )
//	/* The application writer has already defined the array used for the RTOS
//	heap - probably so it can be placed in a special segment or address. */
//extern uint8_t ucHeap[configTOTAL_HEAP_SIZE];
//#else
//static uint8_t ucHeap[configTOTAL_HEAP_SIZE];
//#endif /* configAPPLICATION_ALLOCATED_HEAP */
//
///* Index into the ucHeap array. */
//static size_t xNextFreeByte = (size_t) 0;

// How many bits are one in a given 32-bit uint?

