gojimmypi/IoT_BBQ/IoT_BBQ_STM32/_main.c
    volatile int checkValue = myInitializedVariable;
    
    
//    static char numStr[32];
//    int_to_string(numStr, 32, 42);
//    UART_TxMessage(numStr, 32);
    
    // workspace/STM32CubeL4/Middlewares/Third_Party/FreeRTOS/Source/portable/MemMang/heap_1.c
    pvPortMalloc(0);
    myHeapFreeSize = xPortGetFreeHeapSize();
    pvPortMalloc(0x10);
    myHeapFreeSize = xPortGetFreeHeapSize();
    pvPortMalloc(0x21);
    myHeapFreeSize = xPortGetFreeHeapSize();
    pvPortMalloc(0);

    
    (void) argument;
    int32_t CH1_DC = 0;
 
  
    static uint8_t PressureMessage[] = "Pressure = ";
    static uint8_t HumidityMessage[] = "Humidity = ";
    static uint8_t TemperatureMessage[] = "Temperature = ";    
    static uint8_t ThisTimerMessage[] = "Timer = 0x";
    float thisValue;
    
    for (;;)
    {

        while (1)
        {
//            int timerValue = __HAL_TIM_GET_COUNTER(&htim2);
//
//            // UART_TxMessageIntValueHex(ThisTimerMessage, bufferLenth, (long)htim2.Instance->CNT);
//            UART_TxMessageIntValueHex(ThisTimerMessage, bufferLenth, (long)timerValue);
//            UART_TxMessage(CrLf, bufferLenth);
            
//            osDelay(2000);  // This causes a hard fault!
            static const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;
            osDelay(xDelay);  // this does NOT cause a hard fault

            portENTER_CRITICAL();
//            HAL_NVIC_EnableIRQ(DISCOVERY_I2Cx_EV_IRQn);
//            HAL_NVIC_EnableIRQ(DISCOVERY_I2Cx_ER_IRQn);
            thisValue = BSP_PSENSOR_ReadPressure(); // enable this to cause hard fault in next osDelay
//            HAL_NVIC_DisableIRQ(DISCOVERY_I2Cx_ER_IRQn);
//            HAL_NVIC_DisableIRQ(DISCOVERY_I2Cx_EV_IRQn);
            portEXIT_CRITICAL();   
            
            UART_TxMessageIntValue(PressureMessage, sizeof(PressureMessage), (long)thisValue);
            UART_TxMessage(CrLf, sizeof(CrLf));
            osDelay(2000);
            
//            thisValue = BSP_HSENSOR_ReadHumidity();
//            UART_TxMessageIntValue(HumidityMessage, bufferLenth, (long)thisValue);
//            UART_TxMessage(CrLf, bufferLenth);
//            
//            portENTER_CRITICAL();
//            thisValue = BSP_TSENSOR_ReadTemp();
//            portEXIT_CRITICAL();   
//            
//            UART_TxMessageIntValue(TemperatureMessage, bufferLenth, (long)thisValue);
//            UART_TxMessage(CrLf, bufferLenth);
//            
//            osDelay(2000);
            
//            while (CH1_DC < 65535)
//            {
//                TIM2->CCR1 = CH1_DC;
//                CH1_DC += 70;
//                osDelay(10);
//            }
//            while (CH1_DC > 0)
//            {
//                TIM2->CCR1 = CH1_DC;
//                CH1_DC -= 70;
//                osDelay(10);
//            }
        }
        
    }
}



/**
  * @brief  Toggle LED1
  * @param  thread not used
  * @retval None
  */
static void LED_Thread1(void const *argument)
{
    (void) argument;
  
    for (;;)
    {
        static const TickType_t xDelay = 500 / portTICK_PERIOD_MS;
        static long CurrentTankWeight = 0;
        // static const int bufferLenth = 20;
        static uint8_t WeightMessage[] = "1 Weight = ";
        static uint8_t CrLf[] = "\n\r";
       
        static uint8_t PressureMessage[] = "1 Pressure = ";
        static uint8_t HumidityMessage[] = "1 Humidity = ";
        static uint8_t TemperatureMessage[] = "1 Temperature = ";    
        static uint8_t ThisTimerMessage[] = "1 Timer = 0x";
        float CurrentPressureValue = 0;
        
        // portENTER_CRITICAL(); // this wrapper causes a hard fault upon exit
        CurrentTankWeight = GetScaleWeight();
        // portEXIT_CRITICAL();  

        osDelay(xDelay);
                
        portENTER_CRITICAL();
        CurrentPressureValue = BSP_PSENSOR_ReadPressure(); 
        portEXIT_CRITICAL();  
                
        UART_TxMessageIntValue(PressureMessage, sizeof(PressureMessage), (long)CurrentPressureValue);
        UART_TxMessage(CrLf, sizeof(CrLf));

        UART_TxMessageIntValue(WeightMessage, sizeof(WeightMessage), CurrentTankWeight);
        UART_TxMessage(CrLf, sizeof(CrLf));
        osDelay(xDelay); 
        
        
        switch (LED_GetMode())
        {
        case IsBlinking:
            LED_ON();
            STATE_LED_ON(); // HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
            osDelay((TickType_t)(555 / portTICK_PERIOD_MS));
		
            STATE_LED_OFF(); // HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
            osDelay((TickType_t)(555 / portTICK_PERIOD_MS));

            break;

        case AlwaysOn:
            STATE_LED_ON();      // HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
            osDelay((TickType_t)(1000 / portTICK_PERIOD_MS)); // no sense in runing hard the whole time if we are not blinking
            break;

        case AlwaysOff:
            STATE_LED_OFF();     // HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
            osDelay((TickType_t)(1000 / portTICK_PERIOD_MS)); // no sense in runing hard the whole time if we are not blinking
            break;
            
        default:
            LED_SetMode(IsBlinking);
            break;
        }    
    }
}

/**
  * @brief  Toggle LED2 thread
  * @param  argument not used
  * @retval None
  */
static void LED_Thread2(void const *argument)
{
    uint32_t count;
    (void) argument;
  
    for (;;)
    {
        int blink_Count = 0;
        switch (LED_GetMode())
        {
        case IsBlinking:
            blink_Count = 1;
            break;
            
        case AlwaysOn:
            blink_Count = 2;
            break;

        case AlwaysOff:
            blink_Count = 3;
            break;
            
        default:
            blink_Count = 4;
        }    

        for (size_t i = 0; i < blink_Count; i++)
        {
            LED2_TOGGLE();
            osDelay((TickType_t)(200 / portTICK_PERIOD_MS));
            
            LED2_TOGGLE();
            osDelay((TickType_t)(200 / portTICK_PERIOD_MS));
        }        
        osDelay((TickType_t)(2000 / portTICK_PERIOD_MS));
    }
    osDelay((TickType_t)(2000 / portTICK_PERIOD_MS));
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

     /* Infinite loop */
    while (1)
    {
    }
}
#endif